---
kind: property
id: P:Autodesk.Revit.DB.SlabShapeVertex.Position
source: html/194184c3-4274-cd07-5353-5b65500024db.htm
---
# Autodesk.Revit.DB.SlabShapeVertex.Position Property

The vertex position

## Syntax (C#)
```csharp
public XYZ Position { get; }
```